Revit 2026 API

# FilteredWorksetIteratorReset Method

---

Resets the iterator to the beginning.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual void Reset()
```
```vb
Public Overridable Sub Reset
```
```cpp
public:
virtual void Reset()
```
```fsharp
abstract Reset : unit -> unit
override Reset : unit -> unit
```

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The FilteredWorksetCollector that yielded this iterator has been reset by another operation. No further iteration is permitted with this iterator. |

#### Reference

FilteredWorksetIterator Class

Autodesk.Revit.DB Namespace